app/controllers/properties_controller.rb

	def create
		@property = current_user.properties.build(property_params)
		if @property.save
---
INSERT INTO "properties" ("baths", "beds", "created_at", "description", "name", "rent", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def index
		@properties = Property.paginate(page: params[:page])
---
SELECT "properties".* FROM "properties" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "properties"

	def manage_properties
		if owner_user?
			#@properties = Property.paginate(page: params[:page])
			@properties = current_user.properties.paginate(page: params[:page])
---
SELECT "properties".* FROM "properties" WHERE "properties"."user_id" = $1 LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "properties" WHERE "properties"."user_id" = $1  [["user_id", 1]]

	def edit
		@property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", "1"]]

	def update
		@property = Property.find(params[:id])
		if @property.update_attributes(property_params)
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "properties" SET "baths" = $1, "rent" = $2, "updated_at" = $3 WHERE "properties"."id" = 1  [["baths", 6.0], ["rent", 4301], ["updated_at", Wed, 02 Apr 2014 16:11:20 UTC +00:00]]